Repository: BentBrains/MSAccess-VersionControl
Catalog: Translation/*.po
Languages: pt_br

source: Version Control System
pt_br: Sistema de controle de versionamento

source: Install Add-In
pt_br: Instalar Suplemento

source: Click the Install button to install or update the add-in. In some more secure environments, you may need to use one or both of the additional options.
pt_br: Clique no botão instalar para instalar ou atualizar o suplemento . Em ambientes de maior segurança, possivelmente será necessário uma ou ambas das opções adicionais.

source: Version 3.2.3
pt_br: Versão 3.2.3

source: Trust Add-In Folder
pt_br: Pasta de suplementos

source: Open after install to trust add-in file
pt_br: Abrir após instalar para suplemento confiável

source: Version x.x is currently installed.
pt_br: Versão x.x atualmente instalada.

source: Options
pt_br: Opções

source: Version Control System
pt_br: Sistema de controle de versionamento

source: General
pt_br: Geral

source: Show Detailed Output
pt_br: Mostrar saída detalhada

source: Debug VBA Errors
pt_br: Debugar erros VBA

source: Show Legacy Prompts
pt_br: Mostrar Legacy Prompts

source: Use Git Integration
pt_br: Integração com Git

source: Hash Algorithm:
pt_br: Algoritmo Hash:

source: Use short hashes in index
pt_br: Utilizar hashes curtos no índice

source: Some environments may have specific requirements for hashing algorithms.
pt_br: Alguns ambientes podem conter requisitos específicos para algoritmos hash.

source: Use this form to set your preferred options for exporting and building your database project to and from source files. Note that you can have different options for different projects, and can save a set of options as default for new projects.
pt_br: Utilize esse formulário para configurar suas opções preferidas para exportação e criação do seu projeto de banco de dados. Arquivos fonte 'De' > 'Para'. Repare que você poderá ter diferentes opções para diferentes projetos e poderá salvar um grupo de opções como sendo padrão para novos projetos.

source: Export
pt_br: Exportar

source: Export Folder:
pt_br: Exportar pasta:

source: Use Fast Save
pt_br: Utilizar salvamento rápido

source: Strip out Publish Option
pt_br: Remover a opção de Publicar

source: Aggressive Sanitize
pt_br: Limpeza agressiva

source: Extract Theme Files
pt_br: Extrair arquivos de temas

source: Save Report Print Settings
pt_br: Salvar configurações de impressão de relatório

source: Save Query SQL
pt_br: Salvar consulta SQL

source: Save Table SQL
pt_br: Salvar Tabela SQL

source: Run Sub Before Export:
pt_br: Rodar rotina antes de exportar:

source: Run Sub After Export:
pt_br: Rodar rotina após exportar:

source: (Blank for default)
pt_br: (Deixado em branco por padrão)

source: Options...
pt_br: Opções...

source: Printer Settings
pt_br: Configurações de impressão

source: Page Orientation
pt_br: Orientação de página

source: Paper Size
pt_br: Tamanho do papel

source: Print Quality
pt_br: Qualidade da impressão

source: Display Freq.
pt_br: Mostrar Freq.

source: Collate
pt_br: Ordenar

source: Resolution
pt_br: Resolução

source: Display Flags
pt_br: Mostrar sinalizadores

source: Color or B/W
pt_br: Preto e Branco ou Colorido

source: Number of Copies
pt_br: Número de cópias

source: ICM Method
pt_br: Método ICM

source: Paper Tray
pt_br: Bandeja

source: Print Scale
pt_br: Imprimir Escala

source: Form Name
pt_br: Nome do formulário

source: Custom Length
pt_br: Comprimento personalizado

source: Dither Type
pt_br: Tipo Dither

source: Media Type
pt_br: Tipo de mídia

source: Custom Width
pt_br: Largura personalizada

source: TT Font Handling
pt_br: Tratamento de Fontes TT

source: Select any additional settings that you would like saved to version control and used when building a database from source files.
pt_br: Selecione qualquer configuração adicional que queira salvar no controle de versões e as use quando criando um banco de dados de uma fonte de arquivos.

source: Table Data
pt_br: Dados da tabela

source: Show Hidden
pt_br: Mostrar Ocultos

source: Show System
pt_br: Mostrar objetos do Sistema

source: Selected Table:
pt_br: Selecione a tabela:

source: Data to Export
pt_br: Dados para exportação

source: You may optionally include data from specific tables as part of the export process.
pt_br: Você pode optar por incluir dados oriundos de tabelas específicas como parte do processo de exportação.

source: Show Other
pt_br: Mostrar outros

source: Other...
pt_br: Outros...

source: Build
pt_br: Gerar

source: Force import of original SQL for queries
pt_br: Forçar importação das consultas SQLs originais

source: Run Sub Before Build:
pt_br: Rodar Rotina antes de gerar:

source: Run Sub After Build:
pt_br: Rodar Rotina após gerar:

source: PLEASE NOTE: The build functionality in this tool is fairly new with limited testing in real-world applications. It is very important that you test this carefully in your environment to make sure everything you need is being created in your database duri
pt_br: TOME NOTA: A funcionalidade de geração nesta ferramenta é bem recente com limitações a testes em aplicações reais. É muito importante que você faça testes com cuidado em seu ambiente para garantir que tudo que voce precisa esteja sendo criado em seu banco de dados Por favor verifique a documentação online para detalhes adicionais no processo de construção. Se caso encontrar algum problema, fique à vontade para submeter pendencias e/ou Pull requests no projeto do GitHub

source: ("Save Query SQL" option needed when exporting)
pt_br: ("Salvar consulta SQL" opção necessária quando exportar)

source: Use "module.sub" to specify module
pt_br: Utilize "module.sub" para especificar o módulo

source: (Module name optional)
pt_br: (Nome do módulo opcional)

source: Git Integration
pt_br: Integração com Git

source: Merge Untracked (New) Files
pt_br: Consolidar (Novos) arquivos não rastreados

source: Merge .SQL for queries
pt_br: Consolidar .SQL para consultas

source: Shared Images
pt_br: Imagens compartilhadas

source: Access Theme Files
pt_br: Arquivos de temas do Access

source: Import Modified Table Data
pt_br: Importar tabela com os dados modificados

source: Please see the online documentation for additional information on these settings and the git integration.
pt_br: Favor referenciar à documentação online para informações adicionais dessas configurações e sobre a integração com o Git.

source: Merge Conflict Handling
pt_br: Consolidar tratamento de conflitos

source: Use slower deep inspection for the following items:
pt_br: Utilizar inspeção profunda mais lenta para os seguintes itens:

source: Run Before Merge:
pt_br: Rodar Antes de consolidar:

source: Run After Merge:
pt_br: Rodar Após consolidar:

source: Settings
pt_br: Configurações

source: Save these settings as default for new projects.
pt_br: Salvar essas configurações como padrão para novos projetos.

source: Apply system defaults to this project.
pt_br: Aplicar configurações padrão para este projeto.

source: Reset all default settings to original values.
pt_br: Retornar todas as configurações padrão para seus valores originais.

source: System Defaults
pt_br: Configuração padrão do sistema

source: Remove Add-In
pt_br: Remover suplemento

source: Uninstall this add-in
pt_br: Desinstalar este suplemento

source: Choose Action
pt_br: Escolha a ação

source: What would you like to do?
pt_br: O que gostaria de fazer?

source: Designed for GitHub && GitLab
pt_br: Desenvolvido para GitHub && GitLab

source: Open Log File...
pt_br: Abrir arquivo de Log...

source: Full Export
pt_br: Exportação completa

source: Full Build
pt_br: Criação completa

source: Use this form to set your preferred options for exporting and building your database project to and from source files.
pt_br: Utilize esse formulário para configurar suas opções preferidas para exportação e criação do seu projeto de banco de dados. Arquivos fonte 'De' > 'Para' .

source: Language:
pt_br: Idioma:

source: Contribute to Translations
pt_br: Contribuir com traduções

source: Translations Path:
pt_br: Caminho das traduções:

source: Export Files
pt_br: Exportar Arquivos

source: Load Files
pt_br: Carregar Arquivos

source: How to Use
pt_br: Como utilizar
